# Вводим восьмизначное число
number = int(input("Введите восьмизначное число: "))

if 10_000_000 <= number <= 99_999_999:
    d1 = number // 10_000_000 % 10
    d2 = number // 1_000_000 % 10
    d3 = number // 100_000 % 10
    d4 = number // 10_000 % 10
    d5 = number // 1_000 % 10
    d6 = number // 100 % 10
    d7 = number // 10 % 10
    d8 = number % 10

    total = d1 + d2 + d3 + d4 + d5 + d6 + d7 + d8
    print("Сумма цифр:", total)
else:
    print("Ошибка: нужно ввести именно восьмизначное число.")
